Revit 2024 API
TransactionGroup.GetStatus Method
 Gets the current status of the transaction group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public TransactionStatus GetStatus()
Visual Basic
Public Function GetStatus As TransactionStatus
Visual C++
public:
TransactionStatus GetStatus()
Return Value
 The current status of the transaction group.
See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace